Тестовый/src/Documents/Табель/Табель.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Табель</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеТабеля</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовый/src/Documents/Табель/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИзменитьФорму();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗаполнитьТабель(Команда)
	ЗаполнитьТабельНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ИзменитьФорму()
	ДобавитьРеквизиты();
	ДобавитьЭлементы();
	ЗаполнитьДеревоЗначенийТабеля();
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементы()
	
	Элемент_ДеревоЗначенийТабеля = Элементы.Добавить("ДеревоЗначенийТабеля", Тип("ТаблицаФормы"));
	Элемент_ДеревоЗначенийТабеля.ПутьКДанным = "ДеревоЗначенийТабеля";
	Элемент_ДеревоЗначенийТабеля.КоманднаяПанель.Доступность = Ложь;
	Элемент_ДеревоЗначенийТабеля.КоманднаяПанель.Видимость = Ложь;
	
	Элемент_КолонкаДереваСотрудник = Элементы.Добавить("КолонкаДереваПодразделение", Тип("ПолеФормы"), Элемент_ДеревоЗначенийТабеля);
	Элемент_КолонкаДереваСотрудник.Вид = ВидПоляФормы.ПолеВвода;
	Элемент_КолонкаДереваСотрудник.ПутьКДанным = "ДеревоЗначенийТабеля.КолонкаПодразделение";
	Элемент_КолонкаДереваСотрудник.Заголовок = "Подразделение";

	Элемент_КолонкаДереваСотрудник = Элементы.Добавить("КолонкаДереваСотрудник", Тип("ПолеФормы"), Элемент_ДеревоЗначенийТабеля);
	Элемент_КолонкаДереваСотрудник.Вид = ВидПоляФормы.ПолеВвода;
	Элемент_КолонкаДереваСотрудник.ПутьКДанным = "ДеревоЗначенийТабеля.КолонкаСотрудник";
	Элемент_КолонкаДереваСотрудник.Заголовок = "Сотрудник";
	
	День = 86400;
	
	Массив = СтрРазделить("Пн,Вт,Ср,Чт,Пт,Сб,Вс",",");
	
	Для Индекс = 1 По 7 Цикл
		
		Элемент_ГруппаДанныеТабеля = Элементы.Добавить("ГруппаДанныеТабеля" + Индекс, Тип("ГруппаФормы"), Элемент_ДеревоЗначенийТабеля);
		Элемент_ГруппаДанныеТабеля.Вид = ВидГруппыФормы.ГруппаКолонок;
		Элемент_ГруппаДанныеТабеля.Группировка = ГруппировкаКолонок.Вертикальная;
		
		Элемент_КолонкаДереваДеньНедели = Элементы.Добавить("КолонкаДереваДеньНедели" + Индекс, Тип("ПолеФормы"), Элемент_ГруппаДанныеТабеля);
		Элемент_КолонкаДереваДеньНедели.Вид = ВидПоляФормы.ПолеВвода;
		Элемент_КолонкаДереваДеньНедели.ПутьКДанным = "ДеревоЗначенийТабеля.КолонкаДеньНедели" + Индекс;
		Элемент_КолонкаДереваДеньНедели.Заголовок = Формат(НачалоНедели(Объект.Дата)+День*(Индекс-1), "ДФ=dd.MM")+" "+Массив[Индекс-1];
		Элемент_КолонкаДереваДеньНедели.Ширина = 5;
		
		Элемент_ГруппаПланФактОтклонение = Элементы.Добавить("ГруппаДеньНедели" + Индекс, Тип("ГруппаФормы"), Элемент_ГруппаДанныеТабеля);
		Элемент_ГруппаПланФактОтклонение.Вид = ВидГруппыФормы.ГруппаКолонок;
		Элемент_ГруппаПланФактОтклонение.Группировка = ГруппировкаКолонок.Горизонтальная; 
		
		Элемент_КолонкаДереваЧасыПлан = Элементы.Добавить("КолонкаДереваЧасыПлан" + Индекс, Тип("ПолеФормы"), Элемент_ГруппаПланФактОтклонение);
		Элемент_КолонкаДереваЧасыПлан.Вид = ВидПоляФормы.ПолеВвода;
		Элемент_КолонкаДереваЧасыПлан.ПутьКДанным = "ДеревоЗначенийТабеля.КолонкаЧасыПлан" + Индекс;
		Элемент_КолонкаДереваЧасыПлан.Заголовок = "План";
		Элемент_КолонкаДереваЧасыПлан.Ширина = 5;
		
		Элемент_КолонкаДереваЧасыФакт = Элементы.Добавить("КолонкаДереваЧасыФакт" + Индекс, Тип("ПолеФормы"), Элемент_ГруппаПланФактОтклонение);
		Элемент_КолонкаДереваЧасыФакт.Вид = ВидПоляФормы.ПолеВвода;
		Элемент_КолонкаДереваЧасыФакт.ПутьКДанным = "ДеревоЗначенийТабеля.КолонкаЧасыФакт" + Индекс;
		Элемент_КолонкаДереваЧасыФакт.Заголовок = "Факт";
		Элемент_КолонкаДереваЧасыФакт.Ширина = 5;
		
		Элемент_КолонкаДереваОтклонение = Элементы.Добавить("КолонкаДереваОтклонение" + Индекс, Тип("ПолеФормы"), Элемент_ГруппаПланФактОтклонение);
		Элемент_КолонкаДереваОтклонение.Вид = ВидПоляФормы.ПолеВвода;
		Элемент_КолонкаДереваОтклонение.ПутьКДанным = "ДеревоЗначенийТабеля.КолонкаОтклонение" + Индекс;
		Элемент_КолонкаДереваОтклонение.Заголовок = "Отклонение";
		Элемент_КолонкаДереваОтклонение.Ширина = 5;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизиты()

	МассивДобавляемыхРеквизитов = Новый Массив;
	
	Реквизит_ДеревоЗначенийТабеля = Новый РеквизитФормы("ДеревоЗначенийТабеля", Новый ОписаниеТипов("ДеревоЗначений"));
	МассивДобавляемыхРеквизитов.Добавить(Реквизит_ДеревоЗначенийТабеля);
	
	Реквизит_КолонкаПодразделение = Новый РеквизитФормы("КолонкаПодразделение", 
	Новый ОписаниеТипов("СправочникСсылка.Подразделения, 
						|СправочникСсылка.ФизическиеЛица"), "ДеревоЗначенийТабеля");
	
	МассивДобавляемыхРеквизитов.Добавить(Реквизит_КолонкаПодразделение);
	
	Реквизит_КолонкаСотрудник = Новый РеквизитФормы("КолонкаСотрудник", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"), "ДеревоЗначенийТабеля");
	МассивДобавляемыхРеквизитов.Добавить(Реквизит_КолонкаСотрудник);

	Для Индекс = 1 По 7 Цикл
		Реквизит_КолонкаДеньНедели = Новый РеквизитФормы("КолонкаДеньНедели" + Индекс, Новый ОписаниеТипов("Дата",,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)), "ДеревоЗначенийТабеля");
		МассивДобавляемыхРеквизитов.Добавить(Реквизит_КолонкаДеньНедели);

		Реквизит_КолонкаЧасыФакт = Новый РеквизитФормы("КолонкаЧасыФакт" + Индекс, Новый ОписаниеТипов("Число"), "ДеревоЗначенийТабеля");
		МассивДобавляемыхРеквизитов.Добавить(Реквизит_КолонкаЧасыФакт);

		Реквизит_КолонкаЧасыПлан = Новый РеквизитФормы("КолонкаЧасыПлан" + Индекс, Новый ОписаниеТипов("Число"), "ДеревоЗначенийТабеля");
		МассивДобавляемыхРеквизитов.Добавить(Реквизит_КолонкаЧасыПлан);
		
		Реквизит_КолонкаОтклонение = Новый РеквизитФормы("КолонкаОтклонение" + Индекс, Новый ОписаниеТипов("Число"), "ДеревоЗначенийТабеля");
		МассивДобавляемыхРеквизитов.Добавить(Реквизит_КолонкаОтклонение);
	КонецЦикла;

	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоЗначенийТабеля()
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	ДеревоОбъект = РеквизитФормыВЗначение("ДеревоЗначенийТабеля");
	
	Объект.ДанныеТабеля.Сортировать("Подразделение");
	
	ПредПодразделение = "";
	
	Для Каждого СтрокаТабеля Из Объект.ДанныеТабеля Цикл
		
		Если СтрокаТабеля.Подразделение <> ПредПодразделение Тогда
			НоваяСтрокаДерева = ДеревоОбъект.Строки.Добавить();
			НоваяСтрокаДерева.КолонкаПодразделение = СтрокаТабеля.Подразделение;
		КонецЕсли;
		СтрокаДереваСотрудник = НоваяСтрокаДерева.Строки.Добавить();
		СтрокаДереваСотрудник.КолонкаСотрудник = СтрокаТабеля.Сотрудник;

		Для Индекс = 1 По 7 Цикл
			СтрокаДереваСотрудник["КолонкаЧасыПлан" + Индекс] = Окр(СтрокаТабеля["ЧасыФакт"]/7, 2);
			СтрокаДереваСотрудник["КолонкаЧасыФакт" + Индекс] = ГСЧ.СлучайноеЧисло(4, 8);
			СтрокаДереваСотрудник["КолонкаОтклонение" + Индекс] = Окр(СтрокаДереваСотрудник["КолонкаЧасыПлан" + Индекс]-СтрокаДереваСотрудник["КолонкаЧасыФакт" + Индекс], 2, РежимОкругления.Окр15как20);
		КонецЦикла;
		
		ПредПодразделение = СтрокаТабеля.Подразделение;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоОбъект, "ДеревоЗначенийТабеля");
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТабельНаСервере()
	
	Объект.ДанныеТабеля.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	МассивПодразделений = Новый Массив;
	
	Подразделение1 = Справочники.Подразделения.НайтиПоКоду("000000001");
	Подразделение2 = Справочники.Подразделения.НайтиПоКоду("000000002");
	
	МассивПодразделений.Добавить(Подразделение1);
	МассивПодразделений.Добавить(Подразделение2);

	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.ДанныеТабеля.Добавить();
		НоваяСтрока.Подразделение = МассивПодразделений[ГСЧ.СлучайноеЧисло(0, 1)];
		НоваяСтрока.Сотрудник = Выборка.Ссылка;
		
		НоваяСтрока.ЧасыФакт = ГСЧ.СлучайноеЧисло(20, 40);
		НоваяСтрока.ЧасыПлан = ГСЧ.СлучайноеЧисло(20, 40);
		
	КонецЦикла;
		
КонецПроцедуры

//ПереименоватьКолонкиПоТекНеделе
//
&НаСервере
Процедура ПереименоватьКолонкиПоТекНеделе()
	
	Массив = СтрРазделить("Пн,Вт,Ср,Чт,Пт,Сб,Вс",",");
	День = 86400;
	
	Для Индекс = 1 по 7 Цикл
		ДеньНедели = Формат(Объект.НачалоПериода + День * (Индекс-1), "ДФ=dd.MM");
		НовыйЗаголовок = СтрШаблон("%1 %2", Массив[Индекс-1], ДеньНедели);
		
		КолонкаДень = "КолонкаДереваДеньНедели"+Индекс;
		Элементы[КолонкаДень].Заголовок = НовыйЗаголовок;
	КонецЦикла;

КонецПроцедуры // ПереименоватьКолонкиПоТекНеделе()

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	УстановитьНеделю(Объект.Дата);
	ПереименоватьКолонкиПоТекНеделе();
	
КонецПроцедуры

// УстановитьНеделю
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура УстановитьНеделю(Знач Дата)

	Объект.Дата = КонецНедели(Дата);
	Объект.НачалоПериода = НачалоНедели(Дата);
	
КонецПроцедуры // УстановитьНеделю()

#КонецОбласти
